In [5]:
import mysql.connector                # importing databses

database=mysql.connector.connect(
   host="localhost",
    user="root",
    password="",
    database="class8AM"
)

db=database.cursor()        # this cursor hold the databases

In [3]:
# Reading from databases

db.execute("SELECT * FROM student")
result=db.fetchall()
for x in result:
    print(x)

(1, 'love', 86.0, 78.0, 100.0, 88.0, 80.0, 500.0, 'A+')
(2, 'Iran', 78.0, 76.0, 98.0, 50.0, 80.0, 500.0, 'A')
(3, 'Indar', 87.0, 65.0, 88.0, 50.0, 80.0, 500.0, 'A')
(4, 'sangit', 78.0, 87.0, 98.0, 67.0, 77.0, 500.0, 'A')
(5, 'suprima', 89.0, 87.0, 76.0, 65.0, 96.0, 500.0, 'A')
(6, 'jadav', 78.0, 56.0, 78.0, 98.0, 67.0, 400.0, 'B+')
(7, 'ram', 78.0, 56.0, 67.0, 89.0, 95.0, 500.0, 'A')
(8, 'rama', 78.0, 73.0, 71.0, 92.0, 56.0, 500.0, 'A')

In [6]:
# Reading from databases
sql="select * from student"
db.execute(sql)
result=db.fetchall()
for x in result:
    print(x)

(1, 'love', 86.0, 78.0, 100.0, 88.0, 80.0, 500.0, 'A+')
(2, 'Iran', 78.0, 76.0, 98.0, 50.0, 80.0, 500.0, 'A')
(3, 'Indar', 87.0, 65.0, 88.0, 50.0, 80.0, 500.0, 'A')
(4, 'sangit', 78.0, 87.0, 98.0, 67.0, 77.0, 500.0, 'A')
(5, 'suprima', 89.0, 87.0, 76.0, 65.0, 96.0, 500.0, 'A')
(6, 'jadav', 78.0, 56.0, 78.0, 98.0, 67.0, 400.0, 'B+')
(7, 'ram', 78.0, 56.0, 67.0, 89.0, 95.0, 500.0, 'A')
(8, 'rama', 78.0, 73.0, 71.0, 92.0, 56.0, 500.0, 'A')

In [7]:
# Reading from databases

data=[]
sql="select * from student"
db.execute(sql)
result=db.fetchall()
for x in result:
    data.append(x)
data

[(1, 'love', 86.0, 78.0, 100.0, 88.0, 80.0, 500.0, 'A+'),
 (2, 'Iran', 78.0, 76.0, 98.0, 50.0, 80.0, 500.0, 'A'),
 (3, 'Indar', 87.0, 65.0, 88.0, 50.0, 80.0, 500.0, 'A'),
 (4, 'sangit', 78.0, 87.0, 98.0, 67.0, 77.0, 500.0, 'A'),
 (5, 'suprima', 89.0, 87.0, 76.0, 65.0, 96.0, 500.0, 'A'),
 (6, 'jadav', 78.0, 56.0, 78.0, 98.0, 67.0, 400.0, 'B+'),
 (7, 'ram', 78.0, 56.0, 67.0, 89.0, 95.0, 500.0, 'A'),
 (8, 'rama', 78.0, 73.0, 71.0, 92.0, 56.0, 500.0, 'A')]

In [13]:
# Reading from databases

data=[]
sql="select sn,name,physics,Chemistry,Grade from student"
db.execute(sql)
result=db.fetchall()
for x in result:
    data.append(x)
data

[(1, 'love', 86.0, 78.0, 'A+'),
 (2, 'Iran', 78.0, 76.0, 'A'),
 (3, 'Indar', 87.0, 65.0, 'A'),
 (4, 'sangit', 78.0, 87.0, 'A'),
 (5, 'suprima', 89.0, 87.0, 'A'),
 (6, 'jadav', 78.0, 56.0, 'B+'),
 (7, 'ram', 78.0, 56.0, 'A'),
 (8, 'rama', 78.0, 73.0, 'A')]

In [14]:
# Insert data in databases

sql='''Insert into teacher (sn,name,age,address,salary) values (6,'sangit',22,'Dang',600000)'''
db.execute(sql)
database.commit()

In [15]:
sql='''Insert into teacher (sn,Name,age,Address,salary) values (7,'Pramit',12,'ghorahi',66000)'''
db.execute(sql)
database.commit()

In [17]:
n=int(input('enter n = '))
for i in range(n):
    name=input('enter name = ')
    physics=int(input('enter physics = '))
    chemistry=int(input('enter chemistry = '))
    math=int(input('enter maths = '))
    english=int(input('enter english = '))
    nepali=int(input('enter nepali = '))

    total=physics + chemistry + math + english + nepali
    sql=f"insert into student (name,physics,chemistry,math,english,nepali,total) values ('{name}',{physics},{chemistry},{math},{english},{nepali},{total})"
    db.execute(sql)
database.commit()

enter n = 2
enter name = sangit
enter physics = 12
enter chemistry = 23
enter maths = 34
enter english = 45
enter nepali = 56
enter name = sourya
enter physics = 34
enter chemistry = 45
enter maths = 34
enter english = 23
enter nepali = 34

In [1]:
# creating databases

import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password=''
)
db=database.cursor()
db.execute('create database hellopython')

In [3]:
import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password='',
    database='hellopython'
)
db=database.cursor()
db.execute('create table hpt1 (id int, name varchar(300), subject varchar(300), marks int)')

In [4]:
import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password='',
    database='hellopython'
)
db=database.cursor()
sql="insert into hpt1 (id,name,subject,marks) values (1,'sangit','math',98)"
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted")

1 record inserted

In [5]:
sql="insert into hpt1 (id,name,subject,marks) values (2,'pramit','science',96), (3,'sourya','english',94), (4,'kamal','nepali',92)"
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted")

3 record inserted

In [9]:
import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password='',
    database='hellopython'
)
db=database.cursor()

sql="select * from hpt1"
db.execute(sql)
result=db.fetchall()
for x in result:
    print(x)

(1, 'sangit', 'math', 98)
(2, 'pramit', 'science', 96)
(3, 'sourya', 'english', 94)
(4, 'kamal', 'nepali', 92)

In [10]:
sql="select * from hpt1 where name='sangit'"
db.execute(sql)
result=db.fetchall()
for x in result:
    print(x)

(1, 'sangit', 'math', 98)

In [11]:
sql="delete from hpt1 where name='sourya'"
db.execute(sql)
database.commit()
print(db.rowcount,"record's deleted")

1 record's deleted

In [12]:
sql="select * from hpt1"
db.execute(sql)
result=db.fetchall()
for x in result:
    print(x)

(1, 'sangit', 'math', 98)
(2, 'pramit', 'science', 96)
(4, 'kamal', 'nepali', 92)

In [14]:
sql="update hpt1 set subject='Grammer' where id=2"
db.execute(sql)
database.commit()

In [16]:
sql="select * from hpt1"
db.execute(sql)
result=db.fetchall()
for x in result:
    print(x)

(1, 'sangit', 'math', 98)
(2, 'pramit', 'Grammer', 96)
(4, 'kamal', 'nepali', 92)

In [3]:
import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password='',
    database='hellopython'
)
db=database.cursor()

sql="update hpt1 set marks=94 where id=4"
db.execute(sql)
database.commit()

In [4]:
sql="select * from hpt1"
db.execute(sql)
result=db.fetchall()
for x in result:
    print(x)

(1, 'sangit', 'math', 98)
(2, 'pramit', 'Grammer', 96)
(4, 'kamal', 'nepali', 94)

In [3]:
# creating next table in hpt1 database

import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password='',
    database='hellopython'
)

db=database.cursor()
db.execute("create table hpt2(sn int,name varchar(300),age int, address varchar(300))")

In [4]:
sql="insert into hpt2 (sn,name,age,address) values (1,'sangit',23,'dang')"
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted")

1 record inserted

In [5]:
sql="insert into hpt2 (sn,name,age,address) values (2,'suman',24,'butwal'),(3,'kamal',45,'ktm'),(4,'Ramesh',43,'lalitpur')"
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted")

3 record inserted

In [13]:
# Assignment

# input from user
# 1 for insert
# 2 for select 
# 3 for update
# 4 for delete

In [24]:
import mysql.connector

database=mysql.connector.connect(
    host='localhost',
    user='root',
    password='',
    database='hellopython'
)

db=database.cursor()

n=int(input('enter n = '))

# insert ko lagi

if n==1:
    m=int(input('enter m number = '))
    for i in range(m):
        sn=int(input('enter sn = '))
        name=input('enter name = ')
        age=int(input('enter age = '))
        address=input('enter address = ')
        sql=f"insert into hpt2 (sn,name,age,address) values ({sn},'{name}',{age},'{address}')"
        db.execute(sql)
    database.commit()
    print(db.rowcount,"values inserted")

# select ko lagi

elif n==2:
    db.execute("select * from hpt2")
    result= db.fetchall()
    for x in result:
        print(x)

#update ko lagi

elif n==3:
    sn=int(input('enter sn = '))
    name=input('enter name = ')
    age=int(input('enter age = '))
    address=input('enter address = ')
    sql=f"update hpt2 set name='{name}',age='{age}',address='{address}' where sn={sn}"
    db.execute(sql)
    database.commit()

#delete ko lagi
    
elif n==4:
    name=input('enter name = ')
    sql=f"delete from hpt2 where name ='{name}'"
    db.execute(sql)
    database.commit()

else:
    print("invalid number")

enter n = 4
enter name = sita